[
  {
    "name": "Geography",
    "definition": "The study of the Earth's physical features, human activities, and their interactions, encompassing spatial patterns and processes, such as how climate influences settlement patterns in arid regions like the Sahara, providing a framework for understanding global interconnectedness.",
    "unit": 1
  },
  {
    "name": "Human Geography",
    "definition": "A branch of geography focusing on human activities, cultures, economies, and their spatial organization, exemplified by analyzing urban sprawl in cities like Los Angeles, contrasting with physical geography's emphasis on natural landscapes.",
    "unit": 1
  },
  {
    "name": "Map",
    "definition": "A two-dimensional representation of Earth's surface or a portion thereof, used for navigation and analysis, like thematic maps showing population density, but always involving some distortion due to projecting a sphere onto a flat plane.",
    "unit": 1
  },
  {
    "name": "Cartography",
    "definition": "The science and art of map-making, evolving from ancient hand-drawn sketches to modern digital GIS, where accuracy in scale and projection is crucial for applications like urban planning in growing megacities.",
    "unit": 1
  },
  {
    "name": "Map Projection",
    "definition": "A method to represent the curved Earth on a flat surface, such as the Mercator projection preserving angles for navigation but distorting sizes near poles, affecting perceptions of Africa's true scale relative to Greenland.",
    "unit": 1
  },
  {
    "name": "Mercator Projection",
    "definition": "A cylindrical map projection developed by Gerardus Mercator in 1569, useful for navigation due to straight rhumb lines, but infamous for inflating high-latitude landmasses, leading to Eurocentric worldviews in classrooms.",
    "unit": 1
  },
  {
    "name": "Robinson Projection",
    "definition": "A compromise projection minimizing distortions in size, shape, distance, and direction, often used in world maps for textbooks, balancing accuracy across latitudes unlike conformal or equal-area alternatives.",
    "unit": 1
  },
  {
    "name": "Scale",
    "definition": "The ratio of distance on a map to actual distance on Earth, expressed as representative fraction like 1:100,000, where large-scale maps show small areas in detail, such as city neighborhoods, versus small-scale global overviews.",
    "unit": 1
  },
  {
    "name": "Geographic Information System (GIS)",
    "definition": "A computer system for capturing, storing, analyzing, and displaying spatial data, revolutionizing fields like disaster response by layering maps of population and flood zones in events like Hurricane Katrina.",
    "unit": 1
  },
  {
    "name": "Remote Sensing",
    "definition": "The acquisition of information about Earth's surface from a distance, typically via satellites or aircraft, used for monitoring deforestation in the Amazon or urban expansion in Shanghai through imagery analysis.",
    "unit": 1
  },
  {
    "name": "Global Positioning System (GPS)",
    "definition": "A satellite-based navigation system providing location and time information, enabling applications from smartphone directions to precision agriculture, transforming spatial awareness in daily life.",
    "unit": 1
  },
  {
    "name": "Latitude",
    "definition": "The angular distance north or south of the equator, measured in degrees from 0° at the equator to 90° at the poles, influencing climate zones like the tropics between 23.5°N and 23.5°S.",
    "unit": 1
  },
  {
    "name": "Longitude",
    "definition": "The angular distance east or west of the Prime Meridian, ranging from 0° to 180°, essential for time zones and navigation, with the International Date Line at approximately 180°.",
    "unit": 1
  },
  {
    "name": "Site",
    "definition": "The physical characteristics of a place, such as topography, climate, and resources, influencing settlement choices like New Orleans' location on the Mississippi Delta despite flood risks.",
    "unit": 1
  },
  {
    "name": "Situation",
    "definition": "The location of a place relative to other places, affecting its importance, such as Singapore's strategic position on global trade routes enhancing its role as a financial hub.",
    "unit": 1
  },
  {
    "name": "Region",
    "definition": "An area defined by shared characteristics, whether physical like the Rocky Mountains or human like the Bible Belt, used to organize and analyze spatial patterns in geography.",
    "unit": 1
  },
  {
    "name": "Formal Region",
    "definition": "A region with uniform characteristics defined by official boundaries, such as political entities like states or areas with homogeneous climate, like the Sahara Desert's arid zone.",
    "unit": 1
  },
  {
    "name": "Functional Region",
    "definition": "A region organized around a central node or focal point, such as a metropolitan area served by a commuter rail system, where interactions decrease with distance from the center.",
    "unit": 1
  },
  {
    "name": "Vernacular Region",
    "definition": "A perceptual region based on people's informal sense of place, like 'the Midwest' in the U.S., varying by individual perceptions without strict boundaries.",
    "unit": 1
  },
  {
    "name": "Spatial Analysis",
    "definition": "The examination of patterns and processes in geographic space, using tools like GIS to study phenomena such as disease spread or economic disparities across regions.",
    "unit": 1
  },
  {
    "name": "Diffusion",
    "definition": "The process by which a characteristic spreads across space from its origin, such as the global adoption of smartphones through hierarchical diffusion from urban centers.",
    "unit": 1
  },
  {
    "name": "Relocation Diffusion",
    "definition": "The spread of ideas through physical movement of people, like the migration of cuisine with immigrants, as seen in the proliferation of Mexican food in the U.S.",
    "unit": 1
  },
  {
    "name": "Expansion Diffusion",
    "definition": "The spread of a feature from one place to another in an additive process, including contagious (widespread), hierarchical (through levels), and stimulus (adapted) types, like viral memes online.",
    "unit": 1
  },
  {
    "name": "Distance Decay",
    "definition": "The diminishing interaction between places as distance increases, explaining why people shop locally rather than traveling far, unless for specialized goods.",
    "unit": 1
  },
  {
    "name": "Time-Space Compression",
    "definition": "The reduction in time taken to traverse space due to technological advancements, like air travel shrinking the world, facilitating globalization and cultural exchange.",
    "unit": 1
  },
  {
    "name": "Sustainability",
    "definition": "The use of Earth's renewable and nonrenewable resources in ways that ensure their availability for future generations, balancing economic, environmental, and social factors, as in sustainable forestry practices in Scandinavia.",
    "unit": 1
  },
  {
    "name": "Environmental Determinism",
    "definition": "The theory that environment shapes human societies, like claiming tropical climates hinder development, criticized for oversimplifying cultural and historical factors.",
    "unit": 1
  },
  {
    "name": "Possibilism",
    "definition": "The idea that environment sets limits but humans adapt through culture and technology, such as Dutch polders reclaiming land from sea, emphasizing human agency.",
    "unit": 1
  },
  {
    "name": "Demography",
    "definition": "The statistical study of populations, including size, structure, and distribution, crucial for understanding trends like aging in Japan affecting workforce and healthcare.",
    "unit": 2
  },
  {
    "name": "Population Density",
    "definition": "The number of people per unit area, varying globally from high in urban Singapore to low in rural Mongolia, influencing resource strain and urban planning.",
    "unit": 2
  },
  {
    "name": "Arithmetic Density",
    "definition": "Total population divided by total land area, providing a basic measure but not accounting for habitable land, like Egypt's high density concentrated along the Nile.",
    "unit": 2
  },
  {
    "name": "Physiological Density",
    "definition": "Population per unit of arable land, highlighting pressure on food resources, higher in countries like Bangladesh where farmland is limited relative to people.",
    "unit": 2
  },
  {
    "name": "Agricultural Density",
    "definition": "Number of farmers per unit of arable land, indicating agricultural efficiency, lower in developed nations with mechanization versus higher in labor-intensive systems.",
    "unit": 2
  },
  {
    "name": "Population Pyramid",
    "definition": "A graphical representation of age and sex distribution, shapes indicating growth stages, like expansive pyramids in Nigeria showing high birth rates and youth bulge.",
    "unit": 2
  },
  {
    "name": "Demographic Transition Model (DTM)",
    "definition": "A theory describing population change over time through stages from high birth/death rates to low, exemplified by Europe's shift from Stage 1 pre-industrial to Stage 4 post-industrial.",
    "unit": 2
  },
  {
    "name": "Crude Birth Rate (CBR)",
    "definition": "Annual births per 1,000 population, high in sub-Saharan Africa due to cultural and economic factors, influencing overall growth rates.",
    "unit": 2
  },
  {
    "name": "Crude Death Rate (CDR)",
    "definition": "Annual deaths per 1,000 population, declining globally due to medical advances, but varying by development level and pandemics like COVID-19.",
    "unit": 2
  },
  {
    "name": "Natural Increase Rate (NIR)",
    "definition": "The difference between CBR and CDR, expressed as a percentage, driving population growth in developing regions like South Asia.",
    "unit": 2
  },
  {
    "name": "Total Fertility Rate (TFR)",
    "definition": "Average number of children a woman will have, replacement level at 2.1, below in Europe leading to aging populations and labor shortages.",
    "unit": 2
  },
  {
    "name": "Infant Mortality Rate (IMR)",
    "definition": "Deaths of infants under one year per 1,000 live births, indicator of healthcare quality, high in least developed countries due to malnutrition and disease.",
    "unit": 2
  },
  {
    "name": "Life Expectancy",
    "definition": "The average number of years a newborn can expect to live, higher in developed nations like Japan due to better nutrition and medicine, with gender gaps often favoring females.",
    "unit": 2
  },
  {
    "name": "Malthusian Theory",
    "definition": "Thomas Malthus' 1798 idea that population grows exponentially while food arithmetically, leading to checks like famine, critiqued for underestimating technology like the Green Revolution.",
    "unit": 2
  },
  {
    "name": "Neo-Malthusianism",
    "definition": "Modern adaptation warning of overpopulation straining resources and environment, advocating family planning, as in concerns over climate change impacts on food security.",
    "unit": 2
  },
  {
    "name": "Epidemiologic Transition",
    "definition": "Shifts in mortality causes aligning with DTM, from infectious diseases in early stages to chronic in later, like the rise of heart disease in industrialized societies.",
    "unit": 2
  },
  {
    "name": "Migration",
    "definition": "The movement of people from one place to another with the intention of settling temporarily or permanently in a new location, driven by factors like job opportunities, as in rural-to-urban shifts in China.",
    "unit": 2
  },
  {
    "name": "Push Factors",
    "definition": "Conditions encouraging people to leave a place, such as war or poverty, like conflict in Syria driving refugees to Europe.",
    "unit": 2
  },
  {
    "name": "Pull Factors",
    "definition": "Attractions drawing people to a new place, like economic opportunities or safety, such as tech jobs in Silicon Valley attracting skilled migrants.",
    "unit": 2
  },
  {
    "name": "Ravenstein's Laws of Migration",
    "definition": "19th-century principles stating most migrants move short distances, in steps, and to urban areas, still relevant in patterns like stepwise migration in Latin America.",
    "unit": 2
  },
  {
    "name": "Chain Migration",
    "definition": "Process where migrants follow family or community members, creating ethnic enclaves like Little Italy in New York.",
    "unit": 2
  },
  {
    "name": "Refugee",
    "definition": "A person fleeing persecution, war, or disaster across borders, protected under international law, like Rohingya from Myanmar in Bangladesh camps.",
    "unit": 2
  },
  {
    "name": "Internally Displaced Person (IDP)",
    "definition": "Someone forced to flee within their country, not crossing borders, often due to conflict, as in Colombia's civil war displacements.",
    "unit": 2
  },
  {
    "name": "Asylum Seeker",
    "definition": "Individual seeking international protection from persecution, awaiting refugee status determination, facing backlogs in systems like the U.S.",
    "unit": 2
  },
  {
    "name": "Remittances",
    "definition": "Money sent by migrants to home countries, vital for economies like the Philippines, supporting families and development but highlighting brain drain issues.",
    "unit": 2
  },
  {
    "name": "Brain Drain",
    "definition": "Emigration of skilled workers from developing to developed countries, like Indian doctors to the U.S., depleting origin nations' human capital.",
    "unit": 2
  },
  {
    "name": "Guest Worker",
    "definition": "Temporary migrant laborer, often in programs like Germany's Gastarbeiter or U.S. H-1B visas, filling shortages but sometimes leading to permanent settlement.",
    "unit": 2
  },
  {
    "name": "Culture",
    "definition": "The shared beliefs, values, practices, and artifacts of a group, shaping human geography through elements like language and religion, as in the diverse cultural mosaic of Canada.",
    "unit": 3
  },
  {
    "name": "Cultural Landscape",
    "definition": "The visible imprint of human activity on the environment, like terraced rice fields in Bali or urban skyscrapers, reflecting cultural values and adaptations.",
    "unit": 3
  },
  {
    "name": "Folk Culture",
    "definition": "Traditional practices of small, homogeneous groups in isolated areas, like Amish farming, slow to change and tied to local environments.",
    "unit": 3
  },
  {
    "name": "Popular Culture",
    "definition": "Widespread, heterogeneous practices diffused rapidly via media, like global fast food chains, often originating in urban centers and promoting uniformity.",
    "unit": 3
  },
  {
    "name": "Language",
    "definition": "A system of communication through speech, writing, or signs, with over 7,000 worldwide, serving as a cultural identifier and barrier, like Mandarin's dominance in China.",
    "unit": 3
  },
  {
    "name": "Language Family",
    "definition": "A group of related languages sharing a common ancestor, like Indo-European encompassing English, Hindi, and Spanish, mapping historical migrations.",
    "unit": 3
  },
  {
    "name": "Dialect",
    "definition": "Regional variation of a language with distinct vocabulary, grammar, or pronunciation, like Southern American English, reflecting cultural isolation or mixing.",
    "unit": 3
  },
  {
    "name": "Lingua Franca",
    "definition": "A common language used for communication between speakers of different tongues, like English in international business or Swahili in East Africa.",
    "unit": 3
  },
  {
    "name": "Religion",
    "definition": "A system of beliefs and practices concerning the divine or sacred, influencing landscapes through architecture like mosques or behaviors like dietary laws.",
    "unit": 3
  },
  {
    "name": "Universalizing Religion",
    "definition": "Faiths seeking global converts, like Christianity, Islam, and Buddhism, diffused through missionaries and conquest, contrasting with ethnic religions.",
    "unit": 3
  },
  {
    "name": "Ethnic Religion",
    "definition": "Beliefs tied to a specific group or place, like Judaism or Hinduism, spread mainly through relocation rather than proselytizing.",
    "unit": 3
  },
  {
    "name": "Ethnicity",
    "definition": "Identity based on shared cultural heritage, language, or ancestry, distinct from race, as in Kurdish ethnicity spanning multiple states.",
    "unit": 3
  },
  {
    "name": "Acculturation",
    "definition": "The adoption of cultural traits by one group from another, like immigrants learning host language while retaining some traditions, as in Mexican-Americans.",
    "unit": 3
  },
  {
    "name": "Assimilation",
    "definition": "The complete blending of a minority group into the dominant culture, losing original traits, historically promoted in U.S. 'melting pot' policies.",
    "unit": 3
  },
  {
    "name": "Syncretism",
    "definition": "The blending of cultural elements into a new form, like Vodou combining African and Catholic beliefs in Haiti, illustrating cultural hybridity.",
    "unit": 3
  },
  {
    "name": "Cultural Relativism",
    "definition": "Understanding practices within their cultural context without judgment, countering ethnocentrism, essential for geographic analysis of diverse societies.",
    "unit": 3
  },
  {
    "name": "Ethnocentrism",
    "definition": "Judging other cultures by one's own standards, often leading to prejudice, like viewing non-Western customs as inferior.",
    "unit": 3
  },
  {
    "name": "Cultural Diffusion",
    "definition": "The spread of cultural beliefs and activities, through types like relocation or expansion, as in the global popularity of K-pop from South Korea.",
    "unit": 3
  },
  {
    "name": "Taboo",
    "definition": "A cultural prohibition against certain behaviors or foods, like pork in Islam or beef in Hinduism, shaping dietary landscapes.",
    "unit": 3
  },
  {
    "name": "Hearth",
    "definition": "The origin point of a cultural trait, like the Fertile Crescent for agriculture or Silicon Valley for tech innovation.",
    "unit": 3
  },
  {
    "name": "State",
    "definition": "A politically organized territory with sovereignty, population, and defined boundaries, like France, distinct from nations which are cultural groups.",
    "unit": 4
  },
  {
    "name": "Nation",
    "definition": "A group sharing cultural identity, like the Kurds, who may seek statehood, leading to conflicts in multinational states.",
    "unit": 4
  },
  {
    "name": "Nation-State",
    "definition": "A state where the political boundaries align with a single nation's territory, like Japan, promoting stability through cultural homogeneity.",
    "unit": 4
  },
  {
    "name": "Sovereignty",
    "definition": "The authority of a state to govern itself, challenged by globalization or interventions, as in UN recognition of new states like South Sudan.",
    "unit": 4
  },
  {
    "name": "Boundary",
    "definition": "A line demarcating state territories, types including geometric, physical, or cultural, like the Rio Grande between U.S. and Mexico.",
    "unit": 4
  },
  {
    "name": "Territoriality",
    "definition": "The attempt to control space, from personal to state levels, manifested in border walls or exclusive economic zones in oceans.",
    "unit": 4
  },
  {
    "name": "Centripetal Force",
    "definition": "Factors uniting a state, like shared language or nationalism, as in post-9/11 U.S. patriotism strengthening cohesion.",
    "unit": 4
  },
  {
    "name": "Centrifugal Force",
    "definition": "Divisive elements weakening a state, such as ethnic conflicts or regional disparities, like Quebec's separatism in Canada.",
    "unit": 4
  },
  {
    "name": "Devolution",
    "definition": "Transfer of power from central to regional governments, as in the UK's granting autonomy to Scotland, potentially stabilizing multinational states.",
    "unit": 4
  },
  {
    "name": "Supranationalism",
    "definition": "Cooperation among states for common goals, like the European Union pooling sovereignty for economic and political integration.",
    "unit": 4
  },
  {
    "name": "Balkanization",
    "definition": "The fragmentation of a state into smaller units, often along ethnic lines, as in Yugoslavia's 1990s breakup into multiple countries.",
    "unit": 4
  },
  {
    "name": "Gerrymandering",
    "definition": "Redrawing electoral districts to favor a party, like 'packing' or 'cracking' minorities, affecting representation in the U.S. Congress.",
    "unit": 4
  },
  {
    "name": "Federalism",
    "definition": "Power sharing between national and subnational governments, as in the U.S. or India, allowing regional autonomy while maintaining unity.",
    "unit": 4
  },
  {
    "name": "Unitary State",
    "definition": "Centralized government where power is concentrated nationally, like France, efficient for uniform policies but potentially ignoring regional needs.",
    "unit": 4
  },
  {
    "name": "Irredentism",
    "definition": "Claiming territory in another state inhabited by ethnic kin, like Russia's annexation of Crimea from Ukraine in 2014.",
    "unit": 4
  },
  {
    "name": "Neocolonialism",
    "definition": "Indirect control of former colonies through economic or cultural influence, like multinational corporations exploiting resources in Africa.",
    "unit": 4
  },
  {
    "name": "Agriculture",
    "definition": "The cultivation of plants and rearing of animals for food and other products, evolving from subsistence to commercial, shaping rural landscapes worldwide.",
    "unit": 5
  },
  {
    "name": "Subsistence Agriculture",
    "definition": "Farming to meet family needs with little surplus, common in LDCs like shifting cultivation in Amazon rainforests, vulnerable to environmental changes.",
    "unit": 5
  },
  {
    "name": "Commercial Agriculture",
    "definition": "Large-scale production for market, using technology and capital, like U.S. Midwest grain farms exporting globally.",
    "unit": 5
  },
  {
    "name": "Von Thünen Model",
    "definition": "19th-century theory of agricultural land use in rings around a market city, with intensive farming near center due to transport costs, adapted for modern contexts.",
    "unit": 5
  },
  {
    "name": "Green Revolution",
    "definition": "1960s-1970s introduction of high-yield seeds, fertilizers, and irrigation, boosting production in Asia but criticized for environmental degradation and inequality.",
    "unit": 5
  },
  {
    "name": "Agribusiness",
    "definition": "Integrated commercial farming systems including processing and distribution, like Cargill, dominating global food chains but raising monopoly concerns.",
    "unit": 5
  },
  {
    "name": "Genetically Modified Organism (GMO)",
    "definition": "Crops altered for traits like pest resistance, like Bt corn, increasing yields but debated for health and biodiversity impacts.",
    "unit": 5
  },
  {
    "name": "Organic Farming",
    "definition": "Agriculture without synthetic chemicals, emphasizing sustainability, growing in demand in MDCs like the U.S. for health and environmental reasons.",
    "unit": 5
  },
  {
    "name": "Rural Settlement Patterns",
    "definition": "Arrangements like clustered (villages) or dispersed (farms), influenced by culture and environment, as in nucleated European villages versus American homesteads.",
    "unit": 5
  },
  {
    "name": "Long-Lot System",
    "definition": "French colonial pattern of narrow lots along rivers for access, seen in Quebec or Louisiana, maximizing waterfront for transportation.",
    "unit": 5
  },
  {
    "name": "Metes and Bounds",
    "definition": "Survey system using natural features for boundaries, common in eastern U.S., leading to irregular plots unlike rectangular township-range.",
    "unit": 5
  },
  {
    "name": "Township and Range System",
    "definition": "U.S. Public Land Survey dividing land into grids, facilitating settlement west of Appalachians, creating checkerboard patterns visible from air.",
    "unit": 5
  },
  {
    "name": "Pastoral Nomadism",
    "definition": "Subsistence herding migrating with animals, like Bedouins in Arabia, declining due to sedentarization and borders.",
    "unit": 5
  },
  {
    "name": "Intensive Subsistence Agriculture",
    "definition": "Labor-intensive farming on small plots, like wet rice in Asia, using terracing and double-cropping to support dense populations.",
    "unit": 5
  },
  {
    "name": "Extensive Subsistence Agriculture",
    "definition": "Low-input farming over large areas, like shifting cultivation, sustainable in low-density areas but threatened by deforestation.",
    "unit": 5
  },
  {
    "name": "Plantation Agriculture",
    "definition": "Large estates growing cash crops like rubber or coffee, often in tropics with labor history tied to colonialism and slavery.",
    "unit": 5
  },
  {
    "name": "Urbanization",
    "definition": "The process of population shifting to cities, accelerating globally, with over 50% urban since 2007, driven by industrialization and jobs.",
    "unit": 6
  },
  {
    "name": "Megacity",
    "definition": "A city with over 10 million inhabitants, like Tokyo or Mumbai, facing challenges like slums and infrastructure strain.",
    "unit": 6
  },
  {
    "name": "Metropolis",
    "definition": "A large city serving as an economic and cultural hub, often with suburbs, like New York influencing global finance.",
    "unit": 6
  },
  {
    "name": "Central Place Theory",
    "definition": "Walter Christaller's model explaining settlement size and distribution based on market thresholds and ranges, predicting hexagonal patterns.",
    "unit": 6
  },
  {
    "name": "Urban Hierarchy",
    "definition": "Ranking of settlements from hamlets to world cities, with higher levels offering more specialized services, like Paris as a global city.",
    "unit": 6
  },
  {
    "name": "Primate City",
    "definition": "A disproportionately large city dominating a country, like Bangkok in Thailand, often indicating uneven development.",
    "unit": 6
  },
  {
    "name": "Rank-Size Rule",
    "definition": "Theory that a country's nth largest city is 1/n the size of the largest, holding in balanced economies like the U.S., but not in primate systems.",
    "unit": 6
  },
  {
    "name": "Gentrification",
    "definition": "Revitalization of urban neighborhoods by wealthier residents, displacing lower-income groups, as in Brooklyn's transformation.",
    "unit": 6
  },
  {
    "name": "Urban Sprawl",
    "definition": "Uncontrolled expansion of urban areas into suburbs, consuming farmland, like Los Angeles' car-dependent growth.",
    "unit": 6
  },
  {
    "name": "New Urbanism",
    "definition": "Design movement promoting walkable, mixed-use communities, countering sprawl, as in Seaside, Florida's planned town.",
    "unit": 6
  },
  {
    "name": "Sector Model",
    "definition": "Hoyt's urban land use theory with growth along transportation corridors, like high-income sectors radiating from CBD.",
    "unit": 6
  },
  {
    "name": "Multiple Nuclei Model",
    "definition": "Harris and Ullman's idea of cities with several centers, like airports or universities, reflecting postwar suburbanization.",
    "unit": 6
  },
  {
    "name": "Concentric Zone Model",
    "definition": "Burgess' bullseye pattern of urban growth, with CBD at center surrounded by zones of transition, working class, etc.",
    "unit": 6
  },
  {
    "name": "Edge City",
    "definition": "Suburban nodes with offices and retail, like Tysons Corner near D.C., decentralizing urban functions.",
    "unit": 6
  },
  {
    "name": "Squatter Settlement",
    "definition": "Informal housing in LDC cities, like favelas in Rio, lacking services but providing affordable shelter for migrants.",
    "unit": 6
  },
  {
    "name": "Zoning",
    "definition": "Government regulation of land use, separating residential from industrial, shaping urban form but sometimes exacerbating segregation.",
    "unit": 6
  },
  {
    "name": "Central Business District (CBD)",
    "definition": "Downtown commercial core with high land values, skyscrapers, and transport hubs, like Manhattan's financial district.",
    "unit": 6
  },
  {
    "name": "Industrial Revolution",
    "definition": "18th-19th century shift from agrarian to manufacturing economies, originating in Britain, leading to urbanization and global trade networks.",
    "unit": 7
  },
  {
    "name": "Weber's Least Cost Theory",
    "definition": "Model locating industries to minimize transport costs of materials and products, with weight-losing processes near resources.",
    "unit": 7
  },
  {
    "name": "Agglomeration",
    "definition": "Clustering of industries for shared benefits like labor pools, as in Detroit's auto sector or Hollywood's film industry.",
    "unit": 7
  },
  {
    "name": "Deindustrialization",
    "definition": "Decline of manufacturing in MDCs, like U.S. Rust Belt, due to outsourcing to LDCs for cheaper labor.",
    "unit": 7
  },
  {
    "name": "Fordism",
    "definition": "Mass production with assembly lines and high wages, pioneered by Henry Ford, dominating mid-20th century economies.",
    "unit": 7
  },
  {
    "name": "Post-Fordism",
    "definition": "Flexible production with just-in-time inventory and specialized goods, adapting to global markets in the late 20th century.",
    "unit": 7
  },
  {
    "name": "Maquiladora",
    "definition": "Mexican factories near U.S. border assembling goods for export, benefiting from NAFTA but criticized for low wages and conditions.",
    "unit": 7
  },
  {
    "name": "Special Economic Zone (SEZ)",
    "definition": "Areas with incentives for foreign investment, like China's Shenzhen, driving rapid growth and urbanization.",
    "unit": 7
  },
  {
    "name": "Gross Domestic Product (GDP)",
    "definition": "Total value of goods and services produced within a country, indicator of economic size, but not accounting for distribution.",
    "unit": 7
  },
  {
    "name": "Gross National Income (GNI)",
    "definition": "GDP plus net income from abroad, per capita used to classify development levels, like high in Qatar due to oil.",
    "unit": 7
  },
  {
    "name": "Human Development Index (HDI)",
    "definition": "UN measure combining life expectancy, education, and income, ranking countries, with Norway often topping for balanced progress.",
    "unit": 7
  },
  {
    "name": "Gender Inequality Index (GII)",
    "definition": "Measure of gender disparities in health, empowerment, and labor, highlighting issues in countries like Afghanistan.",
    "unit": 7
  },
  {
    "name": "Core-Periphery Model",
    "definition": "Wallerstein's world systems theory with developed cores exploiting less developed peripheries, explaining global inequalities.",
    "unit": 7
  },
  {
    "name": "Dependency Theory",
    "definition": "Idea that LDCs remain poor due to exploitation by MDCs, through trade and debt, advocating self-reliance.",
    "unit": 7
  },
  {
    "name": "Rostow's Stages of Economic Growth",
    "definition": "Model of development from traditional society to high mass consumption, critiqued for Western bias and ignoring external factors.",
    "unit": 7
  },
  {
    "name": "Sustainable Development",
    "definition": "Development that meets the needs of the present without compromising the ability of future generations to meet their own needs, integrating economic growth, environmental protection, and social equity, as in the UN Sustainable Development Goals targeting poverty and climate by 2030.",
    "unit": 7
  },
  {
    "name": "Microfinance",
    "definition": "Small loans to poor entrepreneurs, like Grameen Bank in Bangladesh, empowering women and fostering local development.",
    "unit": 7
  },
  {
    "name": "Free Trade",
    "definition": "Removal of trade barriers, promoted by WTO, benefiting efficient producers but potentially harming local industries in LDCs.",
    "unit": 7
  },
  {
    "name": "Comparative Advantage",
    "definition": "Ability to produce goods at lower opportunity cost, basis for international trade, like Brazil's soybeans versus U.S. tech.",
    "unit": 7
  },
  {
    "name": "Place",
    "definition": "A specific location on Earth with unique physical and human characteristics that give it meaning, such as the cultural vibrancy and historical landmarks of Rome, Italy, fostering a strong sense of identity.",
    "unit": 1
  },
  {
    "name": "Toponym",
    "definition": "The name assigned to a geographic location, often revealing historical, cultural, or environmental insights, like 'Mississippi River' derived from Native American words meaning 'great river'.",
    "unit": 1
  },
  {
    "name": "Absolute Location",
    "definition": "The precise position of a place on Earth's surface using coordinates, such as the Eiffel Tower at 48.8584°N, 2.2945°E, essential for accurate mapping and navigation.",
    "unit": 1
  },
  {
    "name": "Relative Location",
    "definition": "The position of a place described in relation to other features or places, like describing Dubai as a coastal city in the Arabian Peninsula near the Persian Gulf, influencing its role in trade.",
    "unit": 1
  },
  {
    "name": "Contagious Diffusion",
    "definition": "A form of expansion diffusion where an innovation or idea spreads outward from its origin through direct contact, similar to the rapid dissemination of influenza in densely populated areas.",
    "unit": 1
  },
  {
    "name": "Hierarchical Diffusion",
    "definition": "The spread of a feature or trend from larger to smaller places or from people of higher status to those of lower status, as seen in fashion trends starting in major cities like Paris and reaching smaller towns.",
    "unit": 1
  },
  {
    "name": "Stimulus Diffusion",
    "definition": "The adaptation of an idea or innovation in a new context, where the original form is modified, such as the development of vegetarian burgers inspired by traditional meat-based fast food.",
    "unit": 1
  },
  {
    "name": "Dependency Ratio",
    "definition": "The proportion of non-working-age population (under 15 and over 64) to the working-age population, high in countries like Japan due to aging, impacting economic productivity and social welfare systems.",
    "unit": 2
  },
  {
    "name": "Doubling Time",
    "definition": "The period required for a population to double in size at a constant growth rate, estimated by dividing 70 by the annual growth percentage, short in high-growth areas like sub-Saharan Africa.",
    "unit": 2
  },
  {
    "name": "Pro-Natalist Policy",
    "definition": "Government initiatives to increase birth rates through incentives like child subsidies or parental leave, implemented in countries like Russia to address declining populations.",
    "unit": 2
  },
  {
    "name": "Anti-Natalist Policy",
    "definition": "Measures to discourage high birth rates, such as education campaigns or restrictions, as in India's family planning programs to manage overpopulation and resource demands.",
    "unit": 2
  },
  {
    "name": "Pidgin Language",
    "definition": "A simplified hybrid language formed for basic communication between groups with no common tongue, often in trade contexts, like Nigerian Pidgin English blending local and colonial influences.",
    "unit": 3
  },
  {
    "name": "Creole Language",
    "definition": "A fully developed language evolving from a pidgin, with native speakers and complex grammar, such as Jamaican Creole incorporating English, African, and indigenous elements.",
    "unit": 3
  },
  {
    "name": "Isogloss",
    "definition": "A geographic boundary marking linguistic differences, such as variations in word usage or accent, like the boundary between 'bucket' and 'pail' in American English dialects.",
    "unit": 3
  },
  {
    "name": "Enclave",
    "definition": "A territory entirely surrounded by another state's land, such as Vatican City within Italy, often maintaining independent governance and cultural identity.",
    "unit": 4
  },
  {
    "name": "Exclave",
    "definition": "A detached portion of a state's territory separated by another state, like Kaliningrad as a Russian exclave bordered by Lithuania and Poland, complicating administration.",
    "unit": 4
  },
  {
    "name": "Stateless Nation",
    "definition": "A cultural group lacking its own sovereign state, such as the Tibetans under Chinese rule, often advocating for autonomy or independence.",
    "unit": 4
  },
  {
    "name": "Shifting Cultivation",
    "definition": "An agricultural practice involving clearing land for temporary farming before moving to new plots, allowing soil recovery, prevalent in tropical regions like Southeast Asia.",
    "unit": 5
  },
  {
    "name": "Desertification",
    "definition": "The process by which fertile land becomes desert due to drought, deforestation, or overgrazing, affecting areas like the African Sahel and exacerbating food insecurity.",
    "unit": 5
  },
  {
    "name": "Bid-Rent Theory",
    "definition": "A concept explaining how land values decrease with distance from the urban center, influencing use patterns where commercial activities bid highest for central locations.",
    "unit": 6
  },
  {
    "name": "Suburbanization",
    "definition": "The expansion of residential areas outside city centers, driven by factors like affordable housing and transportation, as in the post-war boom in U.S. suburbs.",
    "unit": 6
  },
  {
    "name": "Purchasing Power Parity (PPP)",
    "definition": "An adjustment to economic indicators accounting for cost-of-living differences, enabling fairer international comparisons, such as evaluating China's GDP more accurately relative to the U.S.",
    "unit": 7
  },
  {
    "name": "Export Processing Zone (EPZ)",
    "definition": "Designated areas providing incentives like tax breaks to boost manufacturing exports, fostering economic growth in developing nations like Bangladesh's garment industry.",
    "unit": 7
  }
]